package answers;

public class HomeWork1Answers {
    public static String getAnswer() {
        return """
                1  Установите JDK 14.

                Тут проблем возникнуть не должно.
                Не советую устанавливать последнюю версию, т.к. могут быть проблемы с кодировкой.
                https://www.fandroid.info/ustanovka-jdk-java-development-kit/\s
                Для справки, коммерческие проекты используют 8 или 11 java, поэтому за новинками гнаться не стоит

                2  Проверьте установку с использованием командной строки (команда java -version), сделайте скриншот вывода.

                Для скриншота можно использовать клавишу PrtScr или можно скачать приложение Lighshot для удобства
                https://clck.ru/fb9H8 – как работать с Lighshot

                3  Установите IDEA Community.

                Вся нужная информация в 1 пункте

                4  Запустите IDEA и создайте первый проект, приложите скриншот.

                С этого проекта начинается ваш путь как разработчика!!)) Думаю все получится.

                5  Создайте в блокноте файл с расширением .java и напишите первую программу вывода текста на экран.

                Внимательно смотрим 4 модуль и повторяем за лектором, все просто)

                6  Скомпилируйте программу, используя командную строку и запустите, приложите скриншот выполнения.

                Тут все дальше по видео-уроку, повторяем, пытаемся вникнуть что происходит и идем дальше.

                7  Запустите IDEA и создайте первый класс в папке src, напишите первую программу вывода текста, запустите и приложите скриншот выполнения.

                https://metanit.com/java/tutorial/1.5.php

                8  Измените программу и на каждом шаге приложите скриншот и код программы.

                a.\tИзмените текст вывода на “I like Java”
                b.\tРаспечатайте 2 строки
                c.\tРаспечатайте 5 строк

                9  Запустите примеры из лекции, приложите код с описанием что происходит.

                Это задание необходимо для понимания кода, уметь читать код очень важно и нужно!
                Для описания используйте комментарии, как их использовать можно узнать тут\s
                https://clck.ru/gcn9h\s

                10  Создайте программу вычисления квадрата числа, приложите код.

                Имеющихся знаний и математики начального класса достаточно для выполнения данного задания. Поехали дальше

                11  Создайте программу вычисления площади прямоугольника и приложите код и скриншоты вывода для каждого из пунктов
                a.	Используйте маленькие значения (byte, short, int)
                b.	Используйте большие значения (long)
                c.	Используйте значения порядка 10^9 - http://proglang.su/java/numbers-pow\s

                12  Напишите программу проверки, что число больше 42, приложите код
                В случае выполнения условия выведите на экран “It’s a kind of magic!”
                http://proglang.su/java/operator-if-else\s

                13  Создайте переменные a b c и поменяйте значения a -> b, b -> c, c -> a, приложите код
                Присваиваем значения по порядку, но внимательно проверяем и смотрим.

                14 (*) Даны три числа – найдите максимальное
                Выстраиваем математическую логику и знания if else\s
                С применением логических операторов, код можно упростить
                https://javarush.ru/groups/posts/logicheskie-operacii-v-java\s

                15  Измените приложение и приложите код
                a.  Получите 3 числа и найдите произведение этих чисел
                В этом задании необходимо перемножить 3 переменные и вывести результат.
                С этого задания советую использовать Ctrl+Alt+l для форматирования кода в удобочитаемый.
                Ссылка на полезные горячие клавиши IDE
                https://devcolibri.com/горячие-клавиши-intellij-idea/\s

                16 Измените приложение и приложите код
                a.	Создайте приложение вычисления среднего 5 чисел от пользователя
                (a + b + c) / 3

                17  Открытый вопрос, приложите код и описание
                a.	Найдите интересное поведение программы
                Тут необходимо прочитать код и порассуждать, нет четких критериев выполнения задания, важно ваше мышление и понимание кода.
                Ответ можно прислать в виде текста, либо скриншот с подробными комментариями.
                b.  Исправьте поведение
                Можно добавить дополнительную логику в ваш код, изменить тип переменных и т. д.

                18  Открытый вопрос , приложите код и описание
                a.	Измените программу на более полезное приложение в ваших повседневных задачах
                Примените код в вашу повседневную жизнь (хобби, работа, увлечения)
                b.  Опишите как это поможет оптимизировать ваши задачи.

                19  Открытый вопрос, приложите описание.
                """;
    }
}