package answers;

public class Introduction {
    public static String getAnswer() {
        return """
                Привет! Ты приобрел(а) курс, значит ты решил как минимум узнать что-то новое в программировании.
                На просторах интернета очень много информации,
                курс должен тебе помочь систематизировать получение знаний,
                чат курса «Профессия Java-разработчик» поможет тебе в трудных вопросах, а бот в решении домашних заданий.
                                
                Но стоит понимать, что основа обучения - это самообразование
                и все зависит только от твоего желания, стойкости и терпения,
                так как придется прочитать и пересмотреть много материала.
                                
                Несколько полезных ссылок для старта:
                                
                https://habr.com/ru/post/460221/ - Как правильно задавать вопросы
                https://habr.com/ru/post/248565/ - Золотые правила программиста
                https://javarush.ru/quests/lectures/questmultithreading.level01.lecture12 - Как правильно гуглить
                https://highload.today/kak-guglit-po-umnomu/ - "гуглить" по-умному
                                
                При сдаче ДЗ не забывай настроить приватность вашего файла,
                чтобы преподаватель смог его открыть,
                проект в Intellij IDEA отправляем архивом в любом удобном формате(rar, zip и т.д.).
                Не забываем ставить отметку ✔ «Сдать домашнюю работу».
                Файл необходимо загрузить в trello в соответствующую карточку с домашним заданием.
                В ДЗ-0 архив ничего загружать не надо!
                                
                Также можно продублировать в чате, что домашняя работа загружена в trello, просьба проверить!
                """;
    }
}
